---
kind: other
id: Properties.T:Autodesk.Revit.DB.FilterNumericRuleEvaluator
source: html/b9ec2096-4494-2b48-b4ff-3afb1d831c93.htm
---
# FilterNumericRuleEvaluator Properties

Specifies whether the .NET object represents a valid Revit entity.